STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield.h
/*-------------------------------------------------------------------------
  STM8AF_STM8S.h - Register Declarations for STMAF and STM8S families 

  Copyright (C) 2019, Georg Icking-Konert

  This library is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program. If not, see <https://www.gnu.org/licenses/>.

  As a special exception, if you link this library with other files
  to produce an executable, this library does not by itself cause the
  resulting executable to be covered by the GNU General Public License.
  This exception does not however invalidate any other reasons why the
  executable file might be covered by the GNU General Public License.
-------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
    MODULE DEFINITION FOR MULTIPLE INCLUSION
-----------------------------------------------------------------------------*/
#ifndef STM8AF_STM8S_H
#define STM8AF_STM8S_H   1

/* Check the used compiler */
#if defined(__CSMC__)
  #define _COSMIC_
#elif defined(__RCST7__)
  #define _RAISONANCE_
#elif defined(__ICCSTM8__)
  #define _IAR_
#elif defined(__SDCC)
  #define _SDCC_
  #define SDCC_VERSION (__SDCC_VERSION_MAJOR * 10000 \
                      + __SDCC_VERSION_MINOR * 100 \
                      + __SDCC_VERSION_PATCH)
#else
  #error in 'STM8AF_STM8S.h': compiler not supported
#endif


/*-----------------------------------------------------------------------------
    MEMORY WIDTH
-----------------------------------------------------------------------------*/

// if memory sizes [B] are not given, assume smallest available in family
#if !defined(STM8_PFLASH_SIZE)
  #warning undefined STM8_PFLASH_SIZE, assume minimum
  #define STM8_PFLASH_SIZE  2*1024
#endif
#if !defined(STM8_RAM_SIZE)
  #warning undefined STM8_RAM_SIZE, assume minimum
  #define STM8_RAM_SIZE     1*1024
#endif
#if !defined(STM8_EEPROM_SIZE)
  #warning undefined STM8_EEPROM_SIZE, assume minimum
  #define STM8_EEPROM_SIZE  128
#endif

// memory start / end addresses
#define STM8_PFLASH_START 0x8000
#define STM8_PFLASH_END   (STM8_PFLASH_START + STM8_PFLASH_SIZE - 1)
#define STM8_RAM_START    0x0000
#define STM8_RAM_END      (STM8_RAM_START + STM8_RAM_SIZE - 1)
#define STM8_EEPROM_START 0x4000
#define STM8_EEPROM_END   (STM8_EEPROM_START + STM8_EEPROM_SIZE - 1)

// address space width (>32kB flash exceeds 16bit, as flash starts at 0x8000)
#if (STM8_PFLASH_END <= 0xFFFF)
  #define STM8_ADDR_WIDTH      16
  #define STM8_MEM_POINTER_T   uint16_t
#else
  #define STM8_ADDR_WIDTH      32
  #define STM8_MEM_POINTER_T   uint32_t
#endif


/*-----------------------------------------------------------------------------
    COMPILER SPECIFIC SETTINGS
-----------------------------------------------------------------------------*/

// Cosmic compiler
#if defined(_COSMIC_)
  
  // macros to unify ISR declaration and implementation
  #define ISR_HANDLER(a,b) @far @interrupt void a(void)
  #define ISR_HANDLER_TRAP(a) void @far @interrupt a(void)

  #define ASM(mnem)            _asm(mnem)                           ///< single line inline assembler
  #define ASM_START            _Pragma("asm")                       ///< start multi-line inline assembler
  #define ASM_END              _Pragma("endasm")                    ///< end multi-line inline assembler
  
  #define FAR                  @far
  #define NEAR                 @near
  #define TINY                 @tiny
  #define EEPROM               @eeprom
  #define CONST                const
  
  #define INLINE               @inline
  #define RAM_FUNC(func)       func

  #if !defined(NULL)
    #define NULL  0
  #endif


// Raisonance Compiler
#elif defined(_RAISONANCE_)
 
  // macros to unify ISR declaration and implementation
  //#define ISR_HANDLER(a,b) @far @interrupt void a(void)
  //#define ISR_HANDLER_TRAP(a) void @far @interrupt a(void)

  #define ASM(mnem)            _asm(mnem)                           ///< single line inline assembler
  //#define ASM_START            _Pragma("asm")                       ///< start multi-line inline assembler
  //#define ASM_END              _Pragma("endasm")                    ///< end multi-line inline assembler

  #define FAR                  far
  #define NEAR                 data
  #define TINY                 page0
  #define EEPROM               eeprom
  #define CONST                code
  
  //#define INLINE               @inline
  #define RAM_FUNC(func)       func inram

  #if STM8_ADDR_WIDTH == 32
    #define MEMCPY             fmemcpy
  #else
    #define MEMCPY             memcpy
  #endif

  #if !defined(NULL)
    #define NULL  0
  #endif


// IAR Compiler
#elif defined(_IAR_)
 
  // macros to unify ISR declaration and implementation
  /*
  #define ISR_HANDLER(a,b) @far @interrupt void a(void)
  #define ISR_HANDLER_TRAP(a) void @far @interrupt a(void)

  #define ASM(mnem)            _asm(mnem)                           ///< single line inline assembler
  #define ASM_START            _Pragma("asm")                       ///< start multi-line inline assembler
  #define ASM_END              _Pragma("endasm")                    ///< end multi-line inline assembler
  */

  #define FAR                  __far
  #define NEAR                 __near
  #define TINY                 __tiny
  #define EEPROM               __eeprom
  #define CONST                const
  
  //#define INLINE               @inline
  #define RAM_FUNC(func)       __ramfunc func

  #if !defined(NULL)
    #define NULL  0
  #endif


// SDCC compiler
#elif defined(_SDCC_)

  // macros to unify ISR declaration and implementation
  #define ISR_HANDLER(a,b) void a(void) __interrupt(b)
  #if SDCC_VERSION >= 30403  // traps require >=v3.4.3
    #define ISR_HANDLER_TRAP(a) void a() __trap 
  #else
    #error traps require SDCC >=3.4.3. Please update!
  #endif 

  #define ASM(mnem)            __asm__(mnem)                        ///< single line inline assembler
  #define ASM_START            __asm                                ///< start multi-line inline assembler
  #define ASM_END              __endasm;                            ///< end multi-line inline assembler

  #define FAR
  #define NEAR
  #define TINY
  #define EEPROM
  #define CONST                const
  
