STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield.h
  #define INLINE               static inline
  #define RAM_FUNC(func)       error RAM execution not yet implemented

  #if !defined(NULL)
    #define NULL  0
  #endif

#endif


/*-----------------------------------------------------------------------------
    DEFINITION OF GLOBAL MACROS/#DEFINES
-----------------------------------------------------------------------------*/

// common assembler instructions
#define NOP                  ASM("nop")           ///< perform a nop() operation (=minimum delay)
#define DISABLE_INTERRUPTS   ASM("sim")           ///< disable interrupt handling
#define ENABLE_INTERRUPTS    ASM("rim")           ///< enable interrupt handling
#define TRIGGER_TRAP         ASM("trap")          ///< trigger a trap (=soft interrupt) e.g. for EMC robustness (see AN1015)
#define WAIT_FOR_INTERRUPT   ASM("wfi")           ///< stop code execution and wait for interrupt
#define ENTER_HALT           ASM("halt")          ///< put controller to HALT mode
#define CRITICAL_START       ASM("sim")           ///< start critical section (see https://tenbaht.github.io/sduino/developer/sdcc/#notes-on-sdcc)
#define CRITICAL_END         ASM("rim")           ///< end critical section (see https://tenbaht.github.io/sduino/developer/sdcc/#notes-on-sdcc)
#define SW_RESET             _WWDG.CR.byte=0xBF   ///< reset controller via WWGD module


/*-----------------------------------------------------------------------------
    STANDARD DATA TYPES
-----------------------------------------------------------------------------*/
#if defined(_COSMIC_) || defined(_RAISONANCE_) || defined(_IAR_)

  // skip if already defined
  #ifndef INT8_MAX

    // compiler specific --> If possible, use <stdint.h> from compiler
    typedef signed long     int32_t;
    typedef signed short    int16_t;
    typedef signed char     int8_t; 
  
    typedef unsigned long   uint32_t;
    typedef unsigned short  uint16_t;
    typedef unsigned char   uint8_t; 
  
  
    // define min/max values
    #define 	INT8_MAX   0x7f
    #define 	INT8_MIN   (-INT8_MAX - 1)
  
    #define 	UINT8_MAX   0xFF
    #define 	UINT8_MIN   0
  
    #define 	INT16_MAX   0x7fff
    #define 	INT16_MIN   (-INT16_MAX - 1)
  
    #define 	UINT16_MAX  0xFFFF
    #define 	UINT16_MIN  0
  
    #define 	INT32_MAX   0x7fffffffL
    #define 	INT32_MIN   (-INT32_MAX - 1L)

    #define 	UINT32_MAX  0xFFFFFFFF
    #define 	UINT32_MIN  0

  #endif // INT8_MAX

#elif defined(_SDCC_)

  // use compiler header
  #include <stdint.h>

#endif


/*-----------------------------------------------------------------------------
    DECLARATION OF GLOBAL TYPEDEFS
-----------------------------------------------------------------------------*/

/** union for bit- or bytewise r/w-access to 8-bit data (byte_t) */
typedef union {

  /// for byte access
  uint8_t  Byte;
  
  /// for bitwise access
  struct {
    int    b0 : 1;     ///< bit 0 in byte
    int    b1 : 1;     ///< bit 1 in byte
    int    b2 : 1;     ///< bit 2 in byte
    int    b3 : 1;     ///< bit 3 in byte
    int    b4 : 1;     ///< bit 4 in byte
    int    b5 : 1;     ///< bit 5 in byte
    int    b6 : 1;     ///< bit 6 in byte
    int    b7 : 1;     ///< bit 7 in byte
  } Bit;
  
} byte_t;


/** struct for bytewise r/w access to 16bit data (word_t)
 \note
   order of r/w access is important and cannot be guaranteed in C --> don't use union like for byte_t
     - write: HB+LB ok / LB+HB and word fails! \n
     - read: LB+HB and word ok / HB+LB fails! \n
*/
typedef struct {
  uint8_t byteH;        ///< high byte in 16b word
  uint8_t byteL;        ///< low byte in 16b word
} word_t;


/*-----------------------------------------------------------------------------
    ISR Vector Table (for SDCC only)
-----------------------------------------------------------------------------*/

/// irq0 - External Top Level interrupt (TLI) for pin PD7
#define __TLI_VECTOR__            0

///< irq1 - Auto Wake Up from Halt interrupt (AWU)
#define __AWU_VECTOR__            1

/// irq2 - Clock Controller interrupt
#define __CLK_VECTOR__            2

/// irq3 - External interrupt 0 (GPIOA)
#define __PORTA_VECTOR__          3

/// irq4 - External interrupt 1 (GPIOB)
#define __PORTB_VECTOR__          4

/// irq5 - External interrupt 2 (GPIOC)
#define __PORTC_VECTOR__          5

/// irq6 - External interrupt 3 (GPIOD)
#define __PORTD_VECTOR__          6

/// irq7 - External interrupt 4 (GPIOE)
#define __PORTE_VECTOR__          7

// irq8 - External interrupt 5 (GPIOF) or CAN receive interrupt (device dependent)
#if defined(CAN_BaseAddress)
  #define __CAN_RX_VECTOR__       8     ///< irq8 - CAN receive interrupt
#else
  #define __PORTF_VECTOR__        8     ///< irq8 - External interrupt 5 (GPIOF)
#endif

// irq9 - CAN transmit interrupt (device dependent)
#if defined(CAN_BaseAddress)
  #define __CAN_TX_VECTOR__       9     ///< irq9 - CAN transmit interrupt
#endif

/// irq10 - SPI End of transfer interrupt
#define __SPI_VECTOR__            10

/// irq11 - TIM1 Update/Overflow/Trigger/Break interrupt
#define __TIM1_UPD_OVF_VECTOR__   11

/// irq12 - TIM1 Capture/Compare interrupt
#define __TIM1_CAPCOM_VECTOR__    12

// irq13 - TIM2 or TIM5 Update/overflow interrupt (device dependent)
#if defined(TIM2_BaseAddress)
  #define __TIM2_UPD_OVF_VECTOR__ 13    ///< irq13 - TIM2 Update/overflow interrupt
#elif defined(TIM5_BaseAddress)
  #define __TIM5_UPD_OVF_VECTOR__ 13    ///< irq13 - TIM5 Update/overflow interrupt
#endif

// irq14 - TIM2 or TIM5 Capture/Compare interrupt (device dependent)
#if defined(TIM2_BaseAddress)
  #define __TIM2_CAPCOM_VECTOR__  14    ///< irq14 - TIM2 Capture/Compare interrupt
#elif defined(TIM5_BaseAddress)
  #define __TIM5_CAPCOM_VECTOR__  14    ///< irq14 - TIM5 Capture/Compare interrupt
#endif

// irq15 - TIM3 Update/overflow interrupt (device dependent)
#if defined(TIM3_BaseAddress)
  #define __TIM3_UPD_OVF_VECTOR__ 15    ///< irq15 - TIM3 Update/overflow interrupt
#endif

// irq16 - TIM3 Capture/Compare interrupt (device dependent)
#if defined(TIM3_BaseAddress)
  #define __TIM3_CAPCOM_VECTOR__  16    ///< irq16 - TIM3 Capture/Compare interrupt
#endif

// irq17 - USART/UART1 send (TX empty) interrupt (device dependent)
#if defined(UART1_BaseAddress)
  #define __UART1_TXE_VECTOR__    17    ///< irq17 - USART/UART1 send (TX empty) interrupt
#endif

