STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield.h
// irq18 - USART/UART1 receive (RX full) interrupt (device dependent)
#if defined(UART1_BaseAddress)
  #define __UART1_RXF_VECTOR__    18    ///< irq18 - USART/UART1 receive (RX full) interrupt
#endif

///< irq19 - I2C interrupt
#define __I2C_VECTOR__            19

// irq20 - UART2, UART3, UART4 send (TX empty) interrupt (device dependent)
#if defined(UART2_BaseAddress)
  #define __UART2_TXE_VECTOR__    20    ///< irq20 - UART2 send (TX empty) interrupt
#elif defined(UART3_BaseAddress)
  #define __UART3_TXE_VECTOR__    20    ///< irq20 - UART3 send (TX empty) interrupt
#elif defined(UART4_BaseAddress)
  #define __UART4_TXE_VECTOR__    20    ///< irq20 - UART4 send (TX empty) interrupt
#endif

// irq21 - UART2, UART3, UART4 receive (RX full) interrupt (device dependent)
#if defined(UART2_BaseAddress)
  #define __UART2_RXF_VECTOR__    21    ///< irq21 - UART2 receive (RX full) interrupt
#elif defined(UART3_BaseAddress)
  #define __UART3_RXF_VECTOR__    21    ///< irq21 - UART3 receive (RX full) interrupt
#elif defined(UART4_BaseAddress)
  #define __UART4_RXF_VECTOR__    21    ///< irq21 - UART4 receive (RX full) interrupt
#endif

// irq22 - ADC1 end of conversion or ADC2 end of conversion & analog watchdog interrupts (device dependent)
#if defined(ADC1_BaseAddress)
  #define __ADC1_VECTOR__         22    ///< irq22 - ADC1 end of conversion
#elif defined(ADC2_BaseAddress)
  #define __ADC2_VECTOR__         22    ///< irq22 - ADC2 end of conversion & analog watchdog interrupts
#endif

///< irq23 - TIM4, TIM6 Update/Overflow interrupt
#if defined(TIM4_BaseAddress)
  #define __TIM4_UPD_OVF_VECTOR__ 23    ///< irq23 - TIM4 Update/Overflow interrupt
#elif defined(TIM6_BaseAddress)
  #define __TIM6_UPD_OVF_VECTOR__ 23    ///< irq23 - TIM6 Update/Overflow interrupt
#endif

/// irq24 - flash interrupt
#define __FLASH_VECTOR__          24


/*-----------------------------------------------------------------------------
    DEFINITION OF STM8 PERIPHERAL REGISTERS
-----------------------------------------------------------------------------*/

//------------------------
// PORT ports (implemented on all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** structure for controlling/monitoring pins in PORT mode (PORT_t) */
  typedef struct {
    byte_t ODR;     ///< Port x output data register (Px_ODR)
    byte_t IDR;     ///< Port x pin input register (Px_IDR)
    byte_t DDR;     ///< Port x data direction register (Px_DDR)
    byte_t CR1;     ///< Port x control register 1 (Px_CR1)
    byte_t CR2;     ///< Port x control register 2 (Px_CR2)
  } PORT_t;

  // port A..F implemented on all devices
  #if defined(PORTA_BaseAddress)
    #define _GPIOA  (*((PORT_t *) PORTA_BaseAddress))   ///< registers for port A access
  #endif
  #if defined(PORTB_BaseAddress)
    #define _GPIOB  (*((PORT_t *) PORTB_BaseAddress))   ///< registers for port B access
  #endif
  #if defined(PORTC_BaseAddress)
    #define _GPIOC  (*((PORT_t *) PORTC_BaseAddress))   ///< registers for port C access
  #endif
  #if defined(PORTD_BaseAddress)
    #define _GPIOD  (*((PORT_t *) PORTD_BaseAddress))   ///< registers for port D access
  #endif
  #if defined(PORTE_BaseAddress)
    #define _GPIOE  (*((PORT_t *) PORTE_BaseAddress))   ///< registers for port E access
  #endif
  #if defined(PORTF_BaseAddress)
    #define _GPIOF  (*((PORT_t *) PORTF_BaseAddress))   ///< registers for port F access
  #endif

  // port G+H+I implemented on selected devices
  #if defined(PORTG_BaseAddress)
    #define _GPIOG  (*((PORT_t *) PORTG_BaseAddress))   ///< registers for port G access
  #endif
  #if defined(PORTH_BaseAddress)
    #define _GPIOH  (*((PORT_t *) PORTH_BaseAddress))   ///< registers for port H access
  #endif
  #if defined(PORTI_BaseAddress)
    #define _GPIOI  (*((PORT_t *) PORTI_BaseAddress))   ///< registers for port I access
  #endif

  /* macro for readability (all ports) */
  #define Pin0   Bit.b0
  #define Pin1   Bit.b1
  #define Pin2   Bit.b2
  #define Pin3   Bit.b3
  #define Pin4   Bit.b4
  #define Pin5   Bit.b5
  #define Pin6   Bit.b6
  #define Pin7   Bit.b7

  /* PORT Module Reset Values (all ports) */
  #define PORT_ODR_RESET_VALUE ((uint8_t)0x00)
  #define PORT_DDR_RESET_VALUE ((uint8_t)0x00)
  #define PORT_CR1_RESET_VALUE ((uint8_t)0x00)
  #define PORT_CR2_RESET_VALUE ((uint8_t)0x00)

#endif // (1)



//------------------------
// Clock module CLK (implemented on all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing clock module registers (CLK) */
  typedef struct {

    /** Internal clock register (CLK_ICKR) */
    union {
    
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    HSIEN   : 1;    ///< High speed internal RC oscillator enable
        int    HSIRDY  : 1;    ///< High speed internal oscillator ready flag
        int    FHW     : 1;    ///< Fast wakeup from Halt/Active-halt modes enable
        int    LSIEN   : 1;    ///< Low speed internal RC oscillator enable
        int    LSIRDY  : 1;    ///< Low speed internal oscillator ready flag
        int    REGAH   : 1;    ///< Regulator power off in Active-halt mode enable
        int    res     : 2;    ///< Reserved, must be kept cleared
      } Reg;
      
    } ICKR;


    /** External clock register (CLK_ECKR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    HSEEN   : 1;    ///< High speed external crystal oscillator enable
        int    HSERDY  : 1;    ///< High speed external crystal oscillator ready
        int    res     : 6;    ///< Reserved, must be kept cleared
      } Reg;
      
    } ECKR;


    /** Reserved register (1B) */
    uint8_t         res[1]; 


