STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield.h
    /** Clock master status register (CLK_CMSR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CKM     : 8;    ///< Clock master status bits
      } Reg;
      
    } CMSR;


    /** Clock master switch register (CLK_SWR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SWI     : 8;    ///< Clock master selection bits
      } Reg;
      
    } SWR;


    /** Switch control register (CLK_SWCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SWBSY   : 1;    ///< Switch busy flag
        int    SWEN    : 1;    ///< Switch start/stop enable
        int    SWIEN   : 1;    ///< Clock switch interrupt enable
        int    SWIF    : 1;    ///< Clock switch interrupt flag
        int    res     : 4;    ///< Reserved
      } Reg;

    } SWCR;


    /** Clock divider register (CLK_CKDIVR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CPUDIV  : 3;    ///< CPU clock prescaler
        int    HSIDIV  : 2;    ///< High speed internal clock prescaler
        int    res     : 3;    ///< Reserved, must be kept cleared.
      } Reg;

    } CKDIVR;


    /** Peripheral clock gating register 1 (CLK_PCKENR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PCKEN_I2C       : 1;    ///< clock enable I2C
        int    PCKEN_SPI       : 1;    ///< clock enable SPI
        int    PCKEN_UART1     : 1;    ///< clock enable UART1
        int    PCKEN_UART2     : 1;    ///< clock enable UART2
        int    PCKEN_TIM4_TIM6 : 1;    ///< clock enable TIM4/TIM6
        int    PCKEN_TIM2_TIM5 : 1;    ///< clock enable TIM4/TIM6
        int    PCKEN_TIM3      : 1;    ///< clock enable TIM3
        int    PCKEN_TIM1      : 1;    ///< clock enable TIM1
      } Reg;
      
    } PCKENR1;


    /** Clock security system register (CLK_CSSR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CSSEN   : 1;    ///< Clock security system enable
        int    AUX     : 1;    ///< Auxiliary oscillator connected to master clock
        int    CSSDIE  : 1;    ///< Clock security system detection interrupt enable
        int    CSSD    : 1;    ///< Clock security system detection
        int    res     : 4;    ///< Reserved, must be kept cleared.
      } Reg;
      
    } CSSR;


    /** Configurable clock output register (CLK_CCOR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CCOEN   : 1;    ///< Configurable clock output enable
        int    CCOSEL  : 4;    ///< Configurable clock output selection.
        int    CCORDY  : 1;    ///< Configurable clock output ready
        int    CCOBSY  : 1;    ///< Configurable clock output busy
        int    res     : 1;    ///< Reserved, must be kept cleared.
      } Reg;

    } CCOR;


    /** Peripheral clock gating register 2 (CLK_PCKENR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res       : 2;   ///< Reserved
        int    PCKEN_AWU : 1;   ///< clock enable AWU
        int    PCKEN_ADC : 1;   ///< clock enable ADC
        int    res2      : 3;   ///< Reserved
        int    PCKEN_CAN : 1;   ///< clock enable CAN
      } Reg;

    } PCKENR2;


    /// Reserved register (1B). Was CAN clock control (obsolete as of STM8 UM rev 7)
    uint8_t         res2[1]; 
    /*
    union {
      uint8_t  Byte;
      struct {
        int    CANDIV  : 3;
        int    res     : 5;
      } Reg;
    } CANCCR;
    */
    

    /** HSI clock calibration trimming register (CLK_HSITRIMR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    HSITRIM : 4;    ///< HSI trimming value (some devices only support 3 bits, see DS!)
        int    res     : 4;    ///< Reserved, must be kept cleared.
      } Reg;
      
    } HSITRIMR;


    /** SWIM clock control register (CLK_SWIMCCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SWIMCLK : 1;    ///< SWIM clock divider
        int    res     : 7;    ///< Reserved.
      } Reg;
      
    } SWIMCCR;

  } CLK_t;

  /// pointer to all CLK registers (all devices)
  #if defined(CLK_BaseAddress)
    #define _CLK  (*((CLK_t *) CLK_BaseAddress))
  #endif
  
  /* CLK Module Reset Values */
  #define CLK_ICKR_RESET_VALUE     ((uint8_t)0x01)
  #define CLK_ECKR_RESET_VALUE     ((uint8_t)0x00)
  #define CLK_CMSR_RESET_VALUE     ((uint8_t)0xE1)
  #define CLK_SWR_RESET_VALUE      ((uint8_t)0xE1)
  #define CLK_SWCR_RESET_VALUE     ((uint8_t)0x00)
  #define CLK_CKDIVR_RESET_VALUE   ((uint8_t)0x18)
  #define CLK_PCKENR1_RESET_VALUE  ((uint8_t)0xFF)
  #define CLK_PCKENR2_RESET_VALUE  ((uint8_t)0xFF)
  #define CLK_CSSR_RESET_VALUE     ((uint8_t)0x00)
  #define CLK_CCOR_RESET_VALUE     ((uint8_t)0x00)
  #define CLK_HSITRIMR_RESET_VALUE ((uint8_t)0x00)
  #define CLK_SWIMCCR_RESET_VALUE  ((uint8_t)0x00)

#endif // (1)



//------------------------
// Window Watchdog WWDG (implemented on all devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing Window Watchdog registers (WWDG) */
  typedef struct {

    /** WWDG Control register (WWDG_CR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    T       : 7;    ///< 7-bit WWDG counter (MSB to LSB)
        int    WDGA    : 1;    ///< WWDG activation bit (not used if WWDG is enabled by option byte)
      } Reg;
      
    } CR;


    /** WWDR Window register (WWDG_WR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    W       : 7;    ///< 7-bit window value
        int    res     : 1;    ///< Reserved
      } Reg;
      
    } WR;

  } WWDG_t;

  /// pointer to all WWDG Window Watchdog registers (all devices)
  #if defined(WWDG_BaseAddress)
    #define _WWDG  (*((WWDG_t *) WWDG_BaseAddress))
  #endif

  /* WWDG Module Reset Values */
  #define WWDG_CR_RESET_VALUE ((uint8_t)0x7F)
  #define WWDG_WR_RESET_VALUE ((uint8_t)0x7F)

