STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield.h
        } ESR;


        /** CAN error interrupt enable register (CAN.Page.Config.EIER) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    EWGIE     : 1;    ///< Error warning interrupt enable
            int    EPVIE     : 1;    ///< Error passive  interrupt enable
            int    BOFIE     : 1;    ///< Bus-Off  interrupt enable
            int    res       : 1;    ///< Reserved
            int    LECIE     : 1;    ///< Last error code interrupt enable
            int    res2      : 2;    ///< Reserved
            int    ERRIE     : 1;    ///< Error interrupt enable
          } Reg;
          
        } EIER;


        /** CAN transmit error counter register (CAN.Page.Config.TECR) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    TEC       : 8;    ///< Transmit error counter
          } Reg;
          
        } TECR;


        /** CAN receive error counter register (CAN.Page.Config.RECR) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    REC       : 8;    ///< Receive error counter
          } Reg;
          
        } RECR;


        /** CAN bit timing register 1 (CAN.Page.Config.BTR1) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    BRP       : 6;    ///< Baud rate prescaler
            int    SJW       : 2;    ///< Resynchronization jump width
          } Reg;
          
        } BTR1;


        /** CAN bit timing register 2 (CAN.Page.Config.BTR2) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    BS1       : 4;    ///< Bit segment 1
            int    BS2       : 3;    ///< Bit segment 2
            int    res       : 1;    ///< Reserved, must be kept cleared
          } Reg;
          
        } BTR2;


        /** Reserved registers (2B) */
        uint8_t       res[2];
        
        
        /** CAN filter mode register 1 (CAN.Page.Config.FMR1) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    FML0      : 1;    ///< Filter 0 mode low
            int    FMH0      : 1;    ///< Filter 0 mode high
            int    FML1      : 1;    ///< Filter 1 mode low
            int    FMH1      : 1;    ///< Filter 1 mode high
            int    FML2      : 1;    ///< Filter 2 mode low
            int    FMH2      : 1;    ///< Filter 2 mode high
            int    FML3      : 1;    ///< Filter 3 mode low
            int    FMH3      : 1;    ///< Filter 3 mode high
          } Reg;
          
        } FMR1;


        /** CAN filter mode register 2 (CAN.Page.Config.FMR2) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    FML4      : 1;    ///< Filter 4 mode low
            int    FMH4      : 1;    ///< Filter 4 mode high
            int    FML5      : 1;    ///< Filter 5 mode low
            int    FMH5      : 1;    ///< Filter 5 mode high
            int    res       : 4;    ///< Reserved
          } Reg;
          
        } FMR2;


        /** CAN filter configuration register 1 (CAN.Page.Config.FCR1) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    FACT0     : 1;    ///< Filter 0 active
            int    FSC0      : 2;    ///< Filter 0 scale configuration
            int    res       : 1;    ///< Reserved
            int    FACT1     : 1;    ///< Filter 1 active
            int    FSC1      : 2;    ///< Filter 1 scale configuration
            int    res2      : 1;    ///< Reserved
          } Reg;
          
        } FCR1;


        /** CAN filter configuration register 2 (CAN.Page.Config.FCR2) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    FACT2     : 1;    ///< Filter 2 active
            int    FSC2      : 2;    ///< Filter 2 scale configuration
            int    res       : 1;    ///< Reserved
            int    FACT3     : 1;    ///< Filter 3 active
            int    FSC3      : 2;    ///< Filter 3 scale configuration
            int    res2      : 1;    ///< Reserve
          } Reg;
          
        } FCR2;




        /** CAN filter configuration register 3 (CAN.Page.Config.FCR3) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    FACT4     : 1;    ///< Filter 4 active
            int    FSC4      : 2;    ///< Filter 4 scale configuration
            int    res       : 1;    ///< Reserved
            int    FACT5     : 1;    ///< Filter 5 active
            int    FSC5      : 2;    ///< Filter 5 scale configuration
            int    res2      : 1;    ///< Reserve
          } Reg;
          
        } FCR3;


        /** Reserved registers (3B) */
        uint8_t       res2[3];

      } Config;



      /** CAN page 7: Receive FIFO (CAN.Page.RxFIFO) */
      struct {

