STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield.h
        /** CAN mailbox filter match index register (CAN.Page.RxFIFO.MFMIR) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    FMI     : 8;    ///< Filter match index  
          } Reg;
          
        } MFMIR;


        /** CAN mailbox data length control register (CAN.Page.RxFIFO.MDLCR) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    DLC       : 4;    ///< Data length code
            int    res       : 3;    ///< Reserved
            int    TGT       : 1;    ///< Transmit global time
          } Reg;
          
        } MDLCR;


        /** CAN mailbox identifier register 1 (CAN.Page.RxFIFO.MIDR1)*/
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    ID        : 5;    ///< STID[10:6] or EXID[28:24]
            int    RTR       : 1;    ///< Remote transmission request
            int    IDE       : 1;    ///< Extended identifier
            int    res       : 1;    ///< Reserved
          } Reg;
          
        } MIDR1;


        /** CAN mailbox identifier register 2 (CAN.Page.RxFIFO.MIDR2) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    EXID      : 2;    ///< EXID[17:16]
            int    ID        : 6;    ///< STID[5:0] or EXID[23:18]
          } Reg;
        } MIDR2;


        /** CAN mailbox identifier register 3 (CAN.Page.RxFIFO.MIDR3) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            int    EXID      : 8;    ///< EXID[15:8]
          } Reg;
          
        } MIDR3;


        /** CAN mailbox identifier register 4 (CAN.Page.RxFIFO.MIDR4) */
        union {
          
          /// bytewise access to register
          uint8_t  Byte;
          
          /// bitwise access to register
          struct {
            uint8_t EXID      : 8;    ///< EXID[7:0]
          } Reg;
          
        } MIDR4;


        /** CAN mailbox data register 1 (CAN.Page.RxFIFO.MDAR1) */
        byte_t    MDAR1;


        /** CAN mailbox data register 2 (CAN.Page.RxFIFO.MDAR1) */
        byte_t    MDAR2;


        /** CAN mailbox data register 3 (CAN.Page.RxFIFO.MDAR1) */
        byte_t    MDAR3;


        /** CAN mailbox data register 4 (CAN.Page.RxFIFO.MDAR1) */
        byte_t    MDAR4;


        /** CAN mailbox data register 5 (CAN.Page.RxFIFO.MDAR1) */
        byte_t    MDAR5;


        /** CAN mailbox data register 6 (CAN.Page.RxFIFO.MDAR1) */
        byte_t    MDAR6;


        /** CAN mailbox data register 7 (CAN.Page.RxFIFO.MDAR1) */
        byte_t    MDAR7;


        /** CAN mailbox data register 8 (CAN.Page.RxFIFO.MDAR1) */
        byte_t    MDAR8;
        
        
        /** CAN mailbox time stamp register (CAN.Page.RxFIFO.MTSR) */
        word_t    MTSR;

      } RxFIFO;

    } Page; 

  } CAN_t;

  /// pointer to all CAN registers (all devices)
  #if defined(CAN_BaseAddress)
    #define _CAN  (*((CAN_t *) CAN_BaseAddress))
  #endif

  /* CAN Module Reset Values */
  #define   CAN_MCR_RESET_VALUE   ((uint8_t)0x02)
  #define   CAN_MSR_RESET_VALUE   ((uint8_t)0x02)
  #define   CAN_TSR_RESET_VALUE   ((uint8_t)0x00)
  #define   CAN_TPR_RESET_VALUE   ((uint8_t)0x0C)
  #define   CAN_RFR_RESET_VALUE   ((uint8_t)0x00)
  #define   CAN_IER_RESET_VALUE   ((uint8_t)0x00)
  #define   CAN_DGR_RESET_VALUE   ((uint8_t)0x0C)
  #define   CAN_PSR_RESET_VALUE   ((uint8_t)0x00)

  #define   CAN_ESR_RESET_VALUE   ((uint8_t)0x00)
  #define   CAN_EIER_RESET_VALUE  ((uint8_t)0x00)
  #define   CAN_TECR_RESET_VALUE  ((uint8_t)0x00)
  #define   CAN_RECR_RESET_VALUE  ((uint8_t)0x00)
  #define   CAN_BTR1_RESET_VALUE  ((uint8_t)0x40)
  #define   CAN_BTR2_RESET_VALUE  ((uint8_t)0x23)
  #define   CAN_FMR1_RESET_VALUE  ((uint8_t)0x00)
  #define   CAN_FMR2_RESET_VALUE  ((uint8_t)0x00)
  #define   CAN_FCR_RESET_VALUE   ((uint8_t)0x00)

  #define   CAN_MFMI_RESET_VALUE  ((uint8_t)0x00)
  #define   CAN_MDLC_RESET_VALUE  ((uint8_t)0x00)
  #define   CAN_MCSR_RESET_VALUE  ((uint8_t)0x00)

#endif // (1)



//------------------------
// UART1 Module (selected devices) with
//    asyncronous & synchronous mode
//    multiprocessor communication
//    SmartCard & IrDA mode
//    1-wire, half-duplex
//    LIN master mode
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing UART1 registers (selected devices) */
  typedef struct {

    /** UART1 Status register (UART1_SR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PE      : 1;    ///< Parity error
        int    FE      : 1;    ///< Framing error
        int    NF      : 1;    ///< Noise flag
        int    OR_LHE  : 1;    ///< LIN Header Error (LIN slave mode) / Overrun error
        int    IDLE    : 1;    ///< IDLE line detected
        int    RXNE    : 1;    ///< Read data register not empty
        int    TC      : 1;    ///< Transmission complete
        int    TXE     : 1;    ///< Transmit data register empty
      } Reg;
      
    } SR;


    /** UART1 data register (UART1_DR) */
    byte_t          DR; 


    /** UART1 Baud rate register 1 (UART1_BRR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UART_DIV_4_11 : 8;    ///< UART_DIV bits [11:4]
      } Reg;
      
    } BRR1;


    /** UART1 Baud rate register 2 (UART1_BRR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UART_DIV_0_3   : 4;    ///< UART_DIV bits [3:0]
        int    UART_DIV_12_15 : 4;    ///< UART_DIV bits [15:12]
      } Reg;
      
