STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield.h
    } CR2;


    /** UART3 Control register 3 (UART3_CR3) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res     : 4;    ///< Reserved, must be kept cleared
        int    STOP    : 2;    ///< STOP bits
        int    LINEN   : 1;    ///< LIN mode enable
        int    res2    : 1;    ///< Reserved, must be kept cleared
      } Reg;
      
    } CR3;


    /** UART3 Control register 4 (UART3_CR4) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    ADD     : 4;    ///< Address of the UART node
        int    LBDF    : 1;    ///< LIN Break Detection Flag
        int    LBDL    : 1;    ///< LIN Break Detection Length
        int    LBDIEN  : 1;    ///< LIN Break Detection Interrupt Enable
        int    res     : 1;    ///< Reserved, must be kept cleared
      } Reg;
      
    } CR4;


    /** Reserved register (1B) */
    uint8_t         res2[1]; 


    /** UART3 Control register 6 (UART3_CR6) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    LSF     : 1;    ///< LIN Sync Field
        int    LHDF    : 1;    ///< LIN Header Detection Flag
        int    LHDIEN  : 1;    ///< LIN Header Detection Interrupt Enable
        int    res     : 1;    ///< Reserved
        int    LASE    : 1;    ///< LIN automatic resynchronisation enable
        int    LSLV    : 1;    ///< LIN Slave Enable
        int    res2    : 1;    ///< Reserved
        int    LDUM    : 1;    ///< LIN Divider Update Method
      } Reg;
      
    } CR6;

  } UART3_t;

  /// pointer to UART3 registers
  #if defined(UART3_BaseAddress)
    #define _UART3  (*((UART3_t *) UART3_BaseAddress))
  #endif

  /* UART3 Module Reset Values */
  #define UART3_SR_RESET_VALUE   ((uint8_t)0xC0)
  #define UART3_BRR1_RESET_VALUE ((uint8_t)0x00)
  #define UART3_BRR2_RESET_VALUE ((uint8_t)0x00)
  #define UART3_CR1_RESET_VALUE  ((uint8_t)0x00)
  #define UART3_CR2_RESET_VALUE  ((uint8_t)0x00)
  #define UART3_CR3_RESET_VALUE  ((uint8_t)0x00)
  #define UART3_CR4_RESET_VALUE  ((uint8_t)0x00)
  #define UART3_CR6_RESET_VALUE  ((uint8_t)0x00)

#endif // (1)



//------------------------
// UART4 Module (selected devices) with
//    asyncronous & synchronous mode
//    multiprocessor communication
//    SmartCard & IrDA mode
//    1-wire, half-duplex
//    LIN master & slave mode
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing UART4 registers (selected devices) */
  typedef struct {

    /** UART4 Status register (UART4_SR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PE      : 1;    ///< Parity error
        int    FE      : 1;    ///< Framing error
        int    NF      : 1;    ///< Noise flag
        int    OR_LHE  : 1;    ///< LIN Header Error (LIN slave mode) / Overrun error
        int    IDLE    : 1;    ///< IDLE line detected
        int    RXNE    : 1;    ///< Read data register not empty
        int    TC      : 1;    ///< Transmission complete
        int    TXE     : 1;    ///< Transmit data register empty
      } Reg;
      
    } SR;


    /** UART4 data register (UART4_DR) */
    byte_t          DR; 


    /** UART4 Baud rate register 1 (UART4_BRR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UART_DIV_4_11 : 8;    ///< UART_DIV bits [11:4]
      } Reg;
      
    } BRR1;


    /** UART4 Baud rate register 2 (UART4_BRR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UART_DIV_0_3   : 4;    ///< UART_DIV bits [3:0]
        int    UART_DIV_12_15 : 4;    ///< UART_DIV bits [15:12]
      } Reg;
      
    } BRR2;


    /** UART4 Control register 1 (UART4_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PIEN    : 1;    ///< Parity interrupt enable
        int    PS      : 1;    ///< Parity selection
        int    PCEN    : 1;    ///< Parity control enable
        int    WAKE    : 1;    ///< Wakeup method
        int    M       : 1;    ///< word length
        int    UARTD   : 1;    ///< UART Disable (for low power consumption)
        int    T8      : 1;    ///< Transmit Data bit 8 (in 9-bit mode)
        int    R8      : 1;    ///< Receive Data bit 8 (in 9-bit mode)
      } Reg;
      
    } CR1;


    /** UART4 Control register 2 (UART4_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    SBK     : 1;    ///< Send break
        int    RWU     : 1;    ///< Receiver wakeup
        int    REN     : 1;    ///< Receiver enable
        int    TEN     : 1;    ///< Transmitter enable
        int    ILIEN   : 1;    ///< IDLE Line interrupt enable
        int    RIEN    : 1;    ///< Receiver interrupt enable
        int    TCIEN   : 1;    ///< Transmission complete interrupt enable
        int    TIEN    : 1;    ///< Transmitter interrupt enable
      } Reg;
      
    } CR2;


    /** UART4 Control register 3 (UART4_CR3) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    LBCL    : 1;    ///< Last bit clock pulse
        int    CPHA    : 1;    ///< Clock phase
        int    CPOL    : 1;    ///< Clock polarity
        int    CKEN    : 1;    ///< Clock enable
        int    STOP    : 2;    ///< STOP bits
        int    LINEN   : 1;    ///< LIN mode enable
        int    res     : 1;    ///< Reserved, must be kept cleared
      } Reg;
      
    } CR3;


