STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield.h
      /// bitwise access to register (input mode)
      struct {
        int    CC4S    : 2;    ///< Capture/compare 4 selection
        int    IC4PSC  : 2;    ///< Input capture 4 prescaler
        int    IC4F    : 4;    ///< Input capture 4 filter
      } regIn;
      
    } CCMR4;


    /** TIM1 Capture/compare enable register 1 (TIM1_CCER1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CC1E    : 1;    ///< Capture/compare 1 output enable
        int    CC1P    : 1;    ///< Capture/compare 1 output polarity
        int    CC1NE   : 1;    ///< Capture/compare 1 complementary output enable
        int    CC1NP   : 1;    ///< Capture/compare 1 complementary output polarity
        int    CC2E    : 1;    ///< Capture/compare 2 output enable
        int    CC2P    : 1;    ///< Capture/compare 2 output polarity
        int    CC2NE   : 1;    ///< Capture/compare 2 complementary output enable
        int    CC2NP   : 1;    ///< Capture/compare 2 complementary output polarity
      } Reg;
      
    } CCER1;


    /** TIM1 Capture/compare enable register 2 (TIM1_CCER2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CC3E    : 1;    ///< Capture/compare 3 output enable
        int    CC3P    : 1;    ///< Capture/compare 3 output polarity
        int    CC3NE   : 1;    ///< Capture/compare 3 complementary output enable
        int    CC3NP   : 1;    ///< Capture/compare 3 complementary output polarity
        int    CC4E    : 1;    ///< Capture/compare 4 output enable
        int    CC4P    : 1;    ///< Capture/compare 4 output polarity
        int    res     : 2;    ///< Reserved
      } Reg;
      
    } CCER2;


    /** TIM1 16-bit counter (TIM1_CNTR) */
    word_t        CNTR;
    
    
    /** TIM1 16-bit prescaler (TIM1_PSCR) */
    word_t        PSCR;
    
    
    /** TIM1 16-bit re-load value (TIM1_ARR) */
    word_t        ARR;
    
    
    /** TIM1 Repetition counter (TIM1_RCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    REP     : 8;    ///< Repetition counter value
      } Reg;
      
    } RCR;


    /** TIM1 16-bit capture/compare value 1 (TIM1_CCR1) */
    word_t        CCR1;


    /** TIM1 16-bit capture/compare value 2 (TIM1_CCR2) */
    word_t        CCR2;


    /** TIM1 16-bit capture/compare value 3 (TIM1_CCR3) */
    word_t        CCR3;


    /** TIM1 16-bit capture/compare value 4 (TIM1_CCR4) */
    word_t        CCR4;
    
    
    /** TIM1 Break register (TIM1_BKR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    LOCK    : 2;    ///< Lock configuration
        int    OSSI    : 1;    ///< Off state selection for idle mode
        int    OSSR    : 1;    ///< Off state selection for Run mode
        int    BKE     : 1;    ///< Break enable
        int    BKP     : 1;    ///< Break polarity
        int    AOE     : 1;    ///< Automatic output enable
        int    MOE     : 1;    ///< Main output enable
      } Reg;
      
    } BKR;


    /** TIM1 Dead-time register (TIM1_DTR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    DTG     : 8;    ///< Deadtime generator set-up
      } Reg;
      
    } DTR;


    /** TIM1 Output idle state register (TIM1_OISR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    OIS1    : 1;    ///< Output idle state 1 (OC1 output)
        int    OIS1N   : 1;    ///< Output idle state 1 (OC1N output)
        int    OIS2    : 1;    ///< Output idle state 2 (OC2 output)
        int    OIS2N   : 1;    ///< Output idle state 2 (OC2N output)
        int    OIS3    : 1;    ///< Output idle state 3 (OC3 output)
        int    OIS3N   : 1;    ///< Output idle state 3 (OC3N output)
        int    OIS4    : 1;    ///< Output idle state 4 (OC4 output)
        int    res     : 1;    ///< Reserved, forced by hardware to 0
      } Reg;
      
    } OISR;

  } TIM1_t;

  /// pointer to all TIM1 registers
  #if defined(TIM1_BaseAddress)
    #define _TIM1  (*((TIM1_t *) TIM1_BaseAddress))
  #endif

  /* TIM1 Module Reset Values */
  #define TIM1_CR1_RESET_VALUE   ((uint8_t)0x00)
  #define TIM1_CR2_RESET_VALUE   ((uint8_t)0x00)
  #define TIM1_SMCR_RESET_VALUE  ((uint8_t)0x00)
  #define TIM1_ETR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM1_IER_RESET_VALUE   ((uint8_t)0x00)
  #define TIM1_SR1_RESET_VALUE   ((uint8_t)0x00)
  #define TIM1_SR2_RESET_VALUE   ((uint8_t)0x00)
  #define TIM1_EGR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM1_CCMR1_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCMR2_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCMR3_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCMR4_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCER1_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCER2_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CNTRH_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CNTRL_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_PSCRH_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_PSCRL_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_ARRH_RESET_VALUE  ((uint8_t)0xFF)
  #define TIM1_ARRL_RESET_VALUE  ((uint8_t)0xFF)
  #define TIM1_RCR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM1_CCR1H_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCR1L_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCR2H_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCR2L_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCR3H_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCR3L_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCR4H_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_CCR4L_RESET_VALUE ((uint8_t)0x00)
  #define TIM1_BKR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM1_DTR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM1_OISR_RESET_VALUE  ((uint8_t)0x00)

