STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield.h
    } CCER1;


    /** TIM2 Capture/compare enable register 2 (TIM2_CCER2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CC3E    : 1;    ///< Capture/compare 3 output enable
        int    CC3P    : 1;    ///< Capture/compare 3 output polarity
        int    res     : 6;    ///< Reserved
      } Reg;
      
    } CCER2;


    /** TIM2 16-bit counter (TIM2_CNTR) */
    word_t        CNTR;


    /** TIM2 clock prescaler (TIM2_PSCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PSC     : 4;    ///< clock prescaler
        int    res     : 4;    ///< Reserved
      } Reg;
      
    } PSCR;
    
    
    /** TIM2 16-bit re-load value (TIM2_ARR) */
    word_t        ARR;


    /** TIM2 16-bit capture/compare value 1 (TIM2_CCR1) */
    word_t        CCR1;


    /** TIM2 16-bit capture/compare value 2 (TIM2_CC2R) */
    word_t        CCR2;


    /** TIM2 16-bit capture/compare value 3 (TIM2_CC3R) */
    word_t        CCR3;

  } TIM2_t;

  /// pointer to all TIM2 registers (selected devices)
  #if defined(TIM2_BaseAddress)
    #define _TIM2  (*((TIM2_t *) TIM2_BaseAddress))
  #endif

  /* TIM2 Module Reset Values */
  #define TIM2_CR1_RESET_VALUE   ((uint8_t)0x00)
  #define TIM2_IER_RESET_VALUE   ((uint8_t)0x00)
  #define TIM2_SR1_RESET_VALUE   ((uint8_t)0x00)
  #define TIM2_SR2_RESET_VALUE   ((uint8_t)0x00)
  #define TIM2_EGR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM2_CCMR1_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CCMR2_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CCMR3_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CCER1_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CCER2_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CNTRH_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CNTRL_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_PSCR_RESET_VALUE  ((uint8_t)0x00)
  #define TIM2_ARRH_RESET_VALUE  ((uint8_t)0xFF)
  #define TIM2_ARRL_RESET_VALUE  ((uint8_t)0xFF)
  #define TIM2_CCR1H_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CCR1L_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CCR2H_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CCR2L_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CCR3H_RESET_VALUE ((uint8_t)0x00)
  #define TIM2_CCR3L_RESET_VALUE ((uint8_t)0x00)

#endif // (1)



//------------------------
// 16-Bit Timer TIM3 (selected devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing TIM3 registers */
  typedef struct {

    /** TIM3 Control register (TIM3_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CEN     : 1;    ///< Counter enable
        int    UDIS    : 1;    ///< Update disable
        int    URS     : 1;    ///< Update request source
        int    OPM     : 1;    ///< One-pulse mode
        int    res     : 3;    ///< Reserved
        int    ARPE    : 1;    ///< Auto-reload preload enable
      } Reg;
      
    } CR1;


    /** TIM3 Interrupt enable (TIM3_IER) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UIE     : 1;    ///< Update interrupt enable
        int    CC1IE   : 1;    ///< Capture/compare 1 interrupt enable
        int    CC2IE   : 1;    ///< Capture/compare 2 interrupt enable
        int    res     : 5;    ///< Reserved 
      } Reg;
      
    } IER;


    /** TIM3 Status register 1 (TIM3_SR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UIF     : 1;    ///< Update interrupt flag
        int    CC1IF   : 1;    ///< Capture/compare 1 interrupt flag
        int    CC2IF   : 1;    ///< Capture/compare 2 interrupt flag
        int    res     : 5;    ///< Reserved
      } Reg;
      
    } SR1;


    /** TIM3 Status register 2 (TIM3_SR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    res     : 1;    ///< Reserved
        int    CC1OF   : 1;    ///< Capture/compare 1 overcapture flag
        int    CC2OF   : 1;    ///< Capture/compare 2 overcapture flag
        int    res2    : 5;    ///< Reserved
      } Reg;
      
    } SR2;


    /** TIM3 Event Generation (TIM3_EGR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UG      : 1;    ///< Update generation
        int    CC1G    : 1;    ///< Capture/compare 1 generation
        int    CC2G    : 1;    ///< Capture/compare 2 generation
        int    res     : 5;    ///< Reserved
      } Reg;
      
    } EGR;


    /** TIM3 Capture/compare mode register 1 (TIM3_CCMR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register (output mode)
      struct {
        int    CC1S    : 2;    ///< Capture/compare 1 selection
        int    res     : 1;    ///< Reserved
        int    OC1PE   : 1;    ///< Output compare 1 preload enable
        int    OC1M    : 3;    ///< Output compare 1 mode
        int    res2    : 1;    ///< Reserved
      } regOut;
      
      /// bitwise access to register (input mode)
      struct {
        int    CC1S    : 2;    ///< Capture/compare 1 selection
        int    IC1PSC  : 2;    ///< Input capture 1 prescaler
        int    IC1F    : 4;    ///< Input capture 1 filter
      } regIn;
      
    } CCMR1;


    /** TIM3 Capture/compare mode register 2 (TIM3_CCMR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register (output mode)
      struct {
        int    CC2S    : 2;    ///< Capture/compare 2 selection
        int    res     : 1;    ///< Reserved
        int    OC2PE   : 1;    ///< Output compare 2 preload enable
        int    OC2M    : 3;    ///< Output compare 2 mode
        int    res2    : 1;    ///< Reserved
      } regOut;
      
