STM8-SPL-license/discussion/Header/STM8AF_STM8S_bitfield.h
      /// bitwise access to register (input mode)
      struct {
        int    CC2S    : 2;    ///< Capture/compare 2 selection
        int    IC2PSC  : 2;    ///< Input capture 2 prescaler
        int    IC2F    : 4;    ///< Input capture 2 filter
      } regIn;
      
    } CCMR2;


    /** TIM3 Capture/compare enable register 1 (TIM3_CCER1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CC1E    : 1;    ///< Capture/compare 1 output enable
        int    CC1P    : 1;    ///< Capture/compare 1 output polarity
        int    res     : 2;    ///< Reserved
        int    CC2E    : 1;    ///< Capture/compare 2 output enable
        int    CC2P    : 1;    ///< Capture/compare 2 output polarity
        int    res2    : 2;    ///< Reserved
      } Reg;
      
    } CCER1;


    /** TIM3 16-bit counter (TIM3_CNTR) */
    word_t        CNTR;


    /** TIM3 clock prescaler (TIM3_PSCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PSC     : 4;    ///< clock prescaler
        int    res     : 4;    ///< Reserved
      } Reg;
      
    } PSCR;
    
    
    /** TIM3 16-bit re-load value (TIM3_ARR) */
    word_t        ARR;


    /** TIM3 16-bit capture/compare value 1 (TIM3_CCR1) */
    word_t        CCR1;


    /** TIM3 16-bit capture/compare value 2 (TIM3_CCR2) */
    word_t        CCR2;

  } TIM3_t;

  /// pointer to all TIM3 registers (selected devices)
  #if defined(TIM3_BaseAddress)
    #define _TIM3  (*((TIM3_t *) TIM3_BaseAddress))
  #endif

  /* TIM3 Module Reset Values */
  #define TIM3_CR1_RESET_VALUE   ((uint8_t)0x00)
  #define TIM3_IER_RESET_VALUE   ((uint8_t)0x00)
  #define TIM3_SR1_RESET_VALUE   ((uint8_t)0x00)
  #define TIM3_SR2_RESET_VALUE   ((uint8_t)0x00)
  #define TIM3_EGR_RESET_VALUE   ((uint8_t)0x00)
  #define TIM3_CCMR1_RESET_VALUE ((uint8_t)0x00)
  #define TIM3_CCMR2_RESET_VALUE ((uint8_t)0x00)
  #define TIM3_CCER1_RESET_VALUE ((uint8_t)0x00)
  #define TIM3_CNTRH_RESET_VALUE ((uint8_t)0x00)
  #define TIM3_CNTRL_RESET_VALUE ((uint8_t)0x00)
  #define TIM3_PSCR_RESET_VALUE  ((uint8_t)0x00)
  #define TIM3_ARRH_RESET_VALUE  ((uint8_t)0xFF)
  #define TIM3_ARRL_RESET_VALUE  ((uint8_t)0xFF)
  #define TIM3_CCR1H_RESET_VALUE ((uint8_t)0x00)
  #define TIM3_CCR1L_RESET_VALUE ((uint8_t)0x00)
  #define TIM3_CCR2H_RESET_VALUE ((uint8_t)0x00)
  #define TIM3_CCR2L_RESET_VALUE ((uint8_t)0x00)

#endif // (1)



//------------------------
// 8-Bit Timer TIM4 (selected devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing TIM4 registers (selected devices) */
  typedef struct {
  
    /** TIM4 Control register (TIM4_CR1) */
    union {
    
      /// bytewise access to register
      uint8_t  Byte;  
    
      /// bitwise access to register
      struct {
        int    CEN     : 1;    ///< Counter enable
        int    UDIS    : 1;    ///< Update disable
        int    URS     : 1;    ///< Update request source
        int    OPM     : 1;    ///< One-pulse mode
        int    res     : 3;    ///< Reserved
        int    ARPE    : 1;    ///< Auto-reload preload enable
      } Reg;
    
    } CR1;
  
  
    /** Reserved registers on selected devices (2B) */
    #if defined(STM8S103) || defined(STM8S003) || defined(STM8S001)
      uint8_t         res[2]; 
    #endif


    /** TIM4 Interrupt enable (TIM4_IER) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UIE     : 1;    ///< Update interrupt enable
        int    res     : 7;    ///< Reserved
      } Reg;
      
    } IER;


    /** TIM4 Status register (TIM4_SR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UIF     : 1;    ///< Update interrupt flag
        int    res     : 7;    ///< Reserved
      } Reg;
      
    } SR1;
  
  
    /** TIM4 Event Generation (TIM4_EGR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    UG      : 1;    ///< Update generation
        int    res     : 7;    ///< Reserved
      } Reg;
      
    } EGR;
  
  
    /** TIM4 8-bit counter register (TIM4_CNTR) */
    byte_t            CNTR;
  
  
    /** TIM4 clock prescaler (TIM4_PSCR) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    PSC     : 3;    ///< clock prescaler
        int    res     : 5;    ///< Reserved
      } Reg;
      
    } PSCR;
  
  
    /** TIM4 8-bit auto-reload register (TIM4_ARR) */
    byte_t            ARR;
  
  } TIM4_t;
  
  /// pointer to TIM4 registers
  #if defined(TIM4_BaseAddress)
    #define _TIM4  (*((TIM4_t *) TIM4_BaseAddress))
  #endif

  /* TIM4 Module Reset Values */
  #define TIM4_CR1_RESET_VALUE  ((uint8_t)0x00)
  #define TIM4_IER_RESET_VALUE  ((uint8_t)0x00)
  #define TIM4_SR1_RESET_VALUE  ((uint8_t)0x00)
  #define TIM4_EGR_RESET_VALUE  ((uint8_t)0x00)
  #define TIM4_CNTR_RESET_VALUE ((uint8_t)0x00)
  #define TIM4_PSCR_RESET_VALUE ((uint8_t)0x00)
  #define TIM4_ARR_RESET_VALUE  ((uint8_t)0xFF)

#endif // (1)



//------------------------
// 16-Bit Timer TIM5 (selected devices)
//------------------------
#if (1)   // dummy for filtering out in editor

  /** struct containing TIM5 registers */
  typedef struct {

    /** TIM5 Control register (TIM5_CR1) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CEN     : 1;    ///< Counter enable
        int    UDIS    : 1;    ///< Update disable
        int    URS     : 1;    ///< Update request source
        int    OPM     : 1;    ///< One-pulse mode
        int    res     : 3;    ///< Reserved
        int    ARPE    : 1;    ///< Auto-reload preload enable
      } Reg;
      
    } CR1;


    /** TIM5 Control register 2 (TIM5_CR2) */
    union {
      
      /// bytewise access to register
      uint8_t  Byte;
      
      /// bitwise access to register
      struct {
        int    CCPC    : 1;    ///< Capture/compare preloaded control
        int    res     : 1;    ///< Reserved, forced by hardware to 0
        int    COMS    : 1;    ///< Capture/compare control update selection
        int    res2    : 1;    ///< Reserved, must be kept cleared
        int    MMS     : 3;    ///< Master mode selection
        int    res3    : 1;    ///< Reserved
      } Reg;
      
